/*_______________________________________________________________________________________________________________________________________________________________________________________________________________________
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── 
─██████████████──██████████──██████──────────██████████████──██████──────────██████──██████████████──██████──────────██████████████──██████──██████──██████████████──████████████████─── 
─██░░░░░░░░░░██──██░░░░░░██──██░░██──────────██░░░░░░░░░░██──██░░██████████──██░░██──██░░░░░░░░░░██──██░░██──────────██░░░░░░░░░░██──██░░██──██░░██──██░░░░░░░░░░██──██░░░░░░░░░░░░██─── 
─██░░██████████──████░░████──██░░██──────────██░░██████████──██░░░░░░░░░░██──██░░██──██████░░██████──██░░██──────────██░░██████░░██──██░░██──██░░██──██░░██████████──██░░████████░░██─── 
─██░░██────────────██░░██────██░░██──────────██░░██──────────██░░██████░░██──██░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░██──██░░██──██░░██──────────██░░██────██░░██─── 
─██░░██████████────██░░██────██░░██──────────██░░██████████──██░░██──██░░██──██░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░██──██░░██──██░░██████████──██░░████████░░██─── 
─██░░░░░░░░░░██────██░░██────██░░██──────────██░░░░░░░░░░██──██░░██──██░░██──██░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░██──██░░██──██░░░░░░░░░░██──██░░░░░░░░░░░░██─── 
─██████████░░██────██░░██────██░░██──────────██░░██████████──██░░██──██░░██──██░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░██──██░░██──██░░██████████──██░░██████░░████─── 
─────────██░░██────██░░██────██░░██──────────██░░██──────────██░░██──██░░██████░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░░░██░░░░██──██░░██──────────██░░██──██░░██───── 
─██████████░░██──████░░████──██░░██████████──██░░██████████──██░░██──██░░░░░░░░░░██──────██░░██──────██░░██████████──██░░██████░░██──████░░░░░░████──██░░██████████──██░░██──██░░██████─ 
─██░░░░░░░░░░██──██░░░░░░██──██░░░░░░░░░░██──██░░░░░░░░░░██──██░░██──██████████░░██──────██░░██──────██░░░░░░░░░░██──██░░░░░░░░░░██────████░░████────██░░░░░░░░░░██──██░░██──██░░░░░░██─ 
─██████████████──██████████──██████████████──██████████████──██████──────────██████──────██████──────██████████████──██████████████──────██████──────██████████████──██████──██████████─ 
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── 
created by Silent_lover432 🕵
contact me 923096287432 ♻️
© Copy coder alert ⚠
*/



/*_______________________________________________________________________________________________________________________________________________________________________________________________________________________
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── 
─██████████████──██████████──██████──────────██████████████──██████──────────██████──██████████████──██████──────────██████████████──██████──██████──██████████████──████████████████─── 
─██░░░░░░░░░░██──██░░░░░░██──██░░██──────────██░░░░░░░░░░██──██░░██████████──██░░██──██░░░░░░░░░░██──██░░██──────────██░░░░░░░░░░██──██░░██──██░░██──██░░░░░░░░░░██──██░░░░░░░░░░░░██─── 
─██░░██████████──████░░████──██░░██──────────██░░██████████──██░░░░░░░░░░██──██░░██──██████░░██████──██░░██──────────██░░██████░░██──██░░██──██░░██──██░░██████████──██░░████████░░██─── 
─██░░██────────────██░░██────██░░██──────────██░░██──────────██░░██████░░██──██░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░██──██░░██──██░░██──────────██░░██────██░░██─── 
─██░░██████████────██░░██────██░░██──────────██░░██████████──██░░██──██░░██──██░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░██──██░░██──██░░██████████──██░░████████░░██─── 
─██░░░░░░░░░░██────██░░██────██░░██──────────██░░░░░░░░░░██──██░░██──██░░██──██░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░██──██░░██──██░░░░░░░░░░██──██░░░░░░░░░░░░██─── 
─██████████░░██────██░░██────██░░██──────────██░░██████████──██░░██──██░░██──██░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░██──██░░██──██░░██████████──██░░██████░░████─── 
─────────██░░██────██░░██────██░░██──────────██░░██──────────██░░██──██░░██████░░██──────██░░██──────██░░██──────────██░░██──██░░██──██░░░░██░░░░██──██░░██──────────██░░██──██░░██───── 
─██████████░░██──████░░████──██░░██████████──██░░██████████──██░░██──██░░░░░░░░░░██──────██░░██──────██░░██████████──██░░██████░░██──████░░░░░░████──██░░██████████──██░░██──██░░██████─ 
─██░░░░░░░░░░██──██░░░░░░██──██░░░░░░░░░░██──██░░░░░░░░░░██──██░░██──██████████░░██──────██░░██──────██░░░░░░░░░░██──██░░░░░░░░░░██────████░░████────██░░░░░░░░░░██──██░░██──██░░░░░░██─ 
─██████████████──██████████──██████████████──██████████████──██████──────────██████──────██████──────██████████████──██████████████──────██████──────██████████████──██████──██████████─ 
──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── 
created by Silent_lover432 🕵
contact me 923096287432 ♻️
© Copy coder alert ⚠
*/





const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')
cmd({

    pattern: "menu3",

    react: "🛸",

    alias: ["panel","list","commands"],

    desc: "Get bot\'s command list.",

    category: "main",

    use: '.menu3',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `
*╭━━〔 ᴄᴍᴅ-ʟɪsᴛ 〕━━┈⊷*
*┃◈╭─────────────·๏*
*┃◈┃• ᴘʟᴀᴛғᴏʀᴍ* : *${process.env.DYNO ? "Heroku" : "Localhost"}*
*┃◈┃• ᴍᴏᴅᴇ* : *[${config.MODE}]*
*┃◈└───────────┈⊷*
*╰─────────────┈⊷*
*╭━━━〔 ✦${config.BOT_NAME}✦ 〕━━━┈⊷*
*┃★╭──────────────•*
*┃★│* ʀᴜɴᴛɪᴍᴇ : *${runtime(process.uptime())}*
*┃★│* ʀᴀᴍ ᴜꜱᴀɢᴇ : *${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB*
*┃★│* ᴍᴏᴅᴇ : *[${config.MODE}]*
*┃★│* ᴘʀᴇғɪx : *[${config.PREFIX}]*
*┃★╰──────────────•*
*╰━━━━━━━━━━━━━━━┈⊷*

┏━━━━━━━━━━━━━━━━━━━━━━━━━━•⟢
   *ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ sɪʟᴇɴᴛ-sᴏʙx-ᴍᴅ ғᴜʟʟ ᴄᴏᴍᴍᴀɴᴅ ʟɪsᴛ*
┗━━━━━━━━━━━━━━━━━━━━━━━━━━•⟢



*╭──❮ DOWNLOAD COMMANDS ❯*
│
│📖 COMMAND: .play
│ℹ️ Download Audio from yt
│ 
│📖 COMMAND: .song
│ℹ️ Download song from yt
│ 
│📖 COMMAND: .apk
│ℹ️ Download apk from playstore
│ 
│📖 COMMAND: .video
│ℹ️ Download video from yt
│ 
│📖 COMMAND: .fb
│ℹ️ Download  video from fb
│ 
│📖 COMMAND: .tt
│ℹ️ Download video from tiktok
│ 
│📖 COMMAND: .ig
│ℹ️ Download video from ig
│ 
│📖 COMMAND: .gdrive
│ℹ️ Download drive files
│ 
│📖 COMMAND: .twitter
│ℹ️ Download video from Twitter
│
│📖 COMMAND: .img
│ℹ️ Download image
│
│📖 COMMAND: .darama
│ℹ️ Download full episode video
│
│📖 COMMAND: .play2
│ℹ️ Download Audio from yt
│ 
│📖 COMMAND: .video2
│ℹ️ Download video from yt
│ 
│📖 COMMAND: .baiscope
│ℹ️ Download video from baiscope
│ 
│📖 COMMAND: .mfire
│ℹ️ Download mediafire files
╰────────────⦁ 

*╭──❮ RANDOM COMMANDS ❯*
│
│📖 COMMAND: .yts
│ℹ️ Serch videos from yt
│
│📖 COMMAND: .king
│ℹ️ get king about 
│
│📖 COMMAND: .dog
│ℹ️ get random dog imgs
│
│📖 COMMAND: .anime 
│ℹ️ get anime pics
│
│📖 COMMAND: .animegirl 
│ℹ️ get animegirl pics
│
│📖 COMMAND: .loli
│ℹ️ get romantic anime pics
╰────────────⦁  

*╭──❮‍ INFO COMMANDS ❯*
│
│📖 COMMAND: .alive
│ℹ️ Check online or not
│  
│📖 COMMAND: .ping
│ℹ️ Check bot speed
│  
│📖 COMMAND: .menu
│ℹ️ Nero main menu
│
│📖 COMMAND: .menu2
│ℹ️ Nero main menu2
│ 
│📖 COMMAND: .ai
│ℹ️ chat with ai bot
│
│📖 COMMAND: .system
│ℹ️ check bot systems
│
│📖 COMMAND: .owner
│ℹ️ get owner info
│ 
│📖 COMMAND: .status
│ℹ️ check bot runtime
│
│📖 COMMAND: .about 
│ℹ️ get about bot 
│
│📖 COMMAND: .list 
│ℹ️ get bot command list
│
│📖 COMMAND: .script 
│ℹ️ get bot repository 
╰────────────⦁

*╭──❮ OTHER COMMANDS ❯*
│
│📖 COMMAND: .joke 
│ℹ️ Get Rendom joke 
│ 
│📖 COMMAND: .fact
│ℹ️ Get Rendom fact
│
│📖 COMMAND: .githubstalk 
│ℹ️ Get github data any user
│ 
│📖 COMMAND: .gpass
│ℹ️ Get a strong password 
│
│📖 COMMAND: .hack
│ℹ️ prank with friends 
│
│📖 COMMAND: .srepo 
│ℹ️ serch repository 
│
│📖 COMMAND: .define 
│ℹ️ serch any words
╰────────────⦁

*╭──❮ GROUP COMMANDS ❯*
│
│📖 COMMAND: .mute
│ℹ️ Mute group
│
│📖 COMMAND: .unmute
│ℹ️ Unmute group
│
│📖 COMMAND: .left
│ℹ️ left group
│
│📖 COMMAND: .jid
│ℹ️ group jid
│
│📖 COMMAND: .remove
│ℹ️ remove member from group
│
│📖 COMMAND: .delete 
│ℹ️ remove sms from group 
│
│📖 COMMAND: .add
│ℹ️ add members in group 
│
│📖 COMMAND: .kick
│ℹ️ kick any user 
│
│📖 COMMAND: .kickall
│ℹ️ remove all members from group
│
│📖 COMMAND: .setgoodbye
│ℹ️ set member leave sms
│
│📖 COMMAND: .setwelcome 
│ℹ️ set member welcome sms
│
│📖 COMMAND: promote 
│ℹ️ make group admin
│
│📖 COMMAND: .demote 
│ℹ️ dissmis any admin 
│
│📖 COMMAND: .tagall
│ℹ️ mention group all members
│
│📖 COMMAND: .getpic
│ℹ️ get group profile
│
│📖 COMMAND: .invite 
│ℹ️ get group invite link
│
│📖 COMMAND: .revoke 
│ℹ️ reset group link
│
│📖 COMMAND: .joinrequests
│ℹ️ cheack group panding members
│
│📖 COMMAND: .allreq
│ℹ️ add group panding members 
│
│📖 COMMAND: .lockgc
│ℹ️ lock group private
│
│📖 COMMAND: .unlockgc
│ℹ️ unlock group all
│
│📖 COMMAND: .leave 
│ℹ️ left any group 
│
│📖 COMMAND: .updategname
│ℹ️ set group name
│
│📖 COMMAND: .updategdesc
│ℹ️ set group description 
│
│📖 COMMAND: .joim
│ℹ️ join invite link 
│
│📖 COMMAND: .hidetag
│ℹ️ mention any user hide
│
│📖 COMMAND: .ginfo
│ℹ️ get group information 
│
│📖 COMMAND: .disappear on
│ℹ️ on disappear sms in group 
│
│📖 COMMAND: .disappear off
│ℹ️ off disappear sms in group 
│
│📖 COMMAND: .senddm
│ℹ️ send disappear sms in group 
│
│📖 COMMAND: .disappear 7d 24h 90d
│ℹ️ set time to disappear sms
╰────────────⦁

*╭──❮ OWNER COMMANDS ❯*
│
│📖 COMMAND: .update
│ℹ️ update bot velue 
│
│📖 COMMAND: .restart 
│ℹ️ restart your bot
│
│📖 COMMAND: .settings
│ℹ️ see bot settings
│
│📖 COMMAND: .owner 
│ℹ️ get owner number 
│
│📖 COMMAND: .repo 
│ℹ️ get bot repository 
│
│📖 COMMAND: .system 
│ℹ️ check bot systems
│
│📖 COMMAND: .block
│ℹ️ block any user 
│
│📖 COMMAND: .unblock 
│ℹ️ unblock any user 
│
│📖 COMMAND: .shutdown 
│ℹ️ logout your bot
│
│📖 COMMAND: .clearchats 
│ℹ️ clearchats from ib
│
│📖 COMMAND: .setpp
│ℹ️ update profile pic
│
│📖 COMMAND: .broadcast 
│ℹ️ creat broadcast 
│
│📖 COMMAND: .jid
│ℹ️ get jid any user
│
│📖 COMMAND: .gjid 
│ℹ️ get group jid
╰────────────⦁

*╭──❮ CONVERT COMMANDS ❯*
│
│📖 COMMAND: .sticker
│ℹ️ convert photo to sticker
│
│📖 COMMAND: .tts
│ℹ️ change text to voice 
│
│📖 COMMAND: .trt 
│ℹ️ change languages 
│
│📖 COMMAND: .vv
│ℹ️ open veiew once msg <photo video>
╰────────────⦁




┏━━━━━━━━━━━━━━━━━━━━━━━━━━•⟢

> *https://github.com/DARKSILENCE04/DARK-SILENCE-MD*

┗━━━━━━━━━━━━━━━━━━━━━━━━━━•⟢

*•────────────•⟢*
> © ᴘᴏᴡᴇʀᴇᴅ ʙʏ sɪʟᴇɴᴛʟᴏᴠᴇʀ⁴³²
*•────────────•⟢*
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu,
                       contextInfo: {
    mentionedJid: [m.sender],
                forwardingScore: 999,
                isForwarded: true,
                forwardedNewsletterMessageInfo: {
                    newsletterJid: '120363189714152560@newsletter',
                    newsletterName: 'DARK-SILENCE-MD',
                    serverMessageId: 143
                }
            }
        }, { quoted: mek })

// Send the audio file with context info
        await conn.sendMessage(from, {
            audio: { url: 'https://github.com/DARKSILENCE04/DARK-SILENCE-MD-DATABASE/raw/refs/heads/main/AUTO_VOICE/AUD-20250309-WA0019.m4a' },
            mimetype: 'audio/mp4',
            ptt: true,
            contextInfo: { 
                mentionedJid: [m.sender],
                forwardingScore: 999,
                isForwarded: true,
                forwardedNewsletterMessageInfo: {
                    newsletterJid: '120363189714152560@newsletter',
                    newsletterName: 'DARK-SILENCE-MD',
                    serverMessageId: 143
                }
            }
        }, { quoted: mek });

    } catch (error) {
        console.error("Error in repo command:", error);
        reply("Sorry, something went wrong while fetching the repository information. Please try again later.");
    }
});
